src/testsuite/sysbench/results/oltp_insert.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 234.58 qps: 234.58 (r/w/o: 0.00/234.58/0.00) lat (ms,95%): 427.07 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 271.00 qps: 271.00 (r/w/o: 0.00/271.00/0.00) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 312.20 qps: 312.20 (r/w/o: 0.00/312.20/0.00) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           16631
        other:                           0
        total:                           16631
    transactions:                        16631  (276.54 per sec.)
    queries:                             16631  (276.54 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      276.5380
    time elapsed:                        60.1408s
    total number of events:              16631

Latency (ms):
         min:                                   66.66
         avg:                                  231.55
         max:                                  733.68
         95th percentile:                      376.49
         sum:                              3850986.23

Threads fairness:
    events (avg/stddev):           259.8594/3.74
    execution time (avg/stddev):   60.1717/0.03

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 448.06 qps: 448.06 (r/w/o: 0.00/448.06/0.00) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 430.75 qps: 430.75 (r/w/o: 0.00/430.75/0.00) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 442.95 qps: 442.95 (r/w/o: 0.00/442.95/0.00) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           26605
        other:                           0
        total:                           26605
    transactions:                        26605  (442.75 per sec.)
    queries:                             26605  (442.75 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      442.7472
    time elapsed:                        60.0915s
    total number of events:              26605

Latency (ms):
         min:                                   66.11
         avg:                                  144.58
         max:                                  458.95
         95th percentile:                      207.82
         sum:                              3846533.89

Threads fairness:
    events (avg/stddev):           415.7031/5.26
    execution time (avg/stddev):   60.1021/0.01